Revit 2027 API
RebarBendingDetail.GetTagRelativeRotation Method
 Gets the embedded tag rotation angle w.r.t. the realistic bending detail element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double GetTagRelativeRotation(
	Element bendingDetail
)
Public Shared Function GetTagRelativeRotation (
	bendingDetail As Element
) As Double
public:
static double GetTagRelativeRotation(
	Element^ bendingDetail
)
static member GetTagRelativeRotation :
        bendingDetail : Element -> float
Parameters
bendingDetail Element
 The bending detail element.
Return Value
Double
 The rotation angle of the embedded tag w.r.t. the bending detail element.
Exceptions
Exception | Condition
ArgumentException |  This option is only available for realistic bending detail elements.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function is exclusive to realistic bending detail mode.
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace